app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    if @project.save